[
  {
    "date": "December 2020",
    "title": "Explored Python Data Science",
    "body": "Completed various IBM Coursera courses (Data Analyses, Databases and SQL, ...). Decided this area didn't interest me, it feels more like statistics than programming and it didn't satisfy that problem solving itch.",
    "linkText": "View Earned Badges",
    "linkUrl": "https://www.credly.com/users/zachary-mcrae/badges"
  },
  {
    "date": "Jan 2021",
    "title": "Exploring Web Development with Python",
    "body": "Started playing with web APIs like the Spotify API to get top tracks and artists. Lead to me tinkering with Flask web framework.",
    "linkText": "View Spotify API",
    "linkUrl": "https://developer.spotify.com/documentation/web-api/"
  },
  {
    "date": "Feb 2021",
    "title": "Made My First Site",
    "body": "The site uses the Spotify API to access a user's top tracks/artists. Learned a lot of Flask, general web development and bootstrap. Also learned how to configure Ngninx on my Linode VPS and deploy the site myself.",
    "linkText": "View spotifystats.xyz",
    "linkUrl": "https://spotifystats.xyz/"
  },
  {
    "date": "Mar 2021",
    "title": "Working with Databases",
    "body": "I made a todo list site with the intent to learn databases, forms and user accounts. I used SQLAlchemy ORM with a SQLite database.",
    "linkText": "View lsts.xyz",
    "linkUrl": "https://lsts.xyz/"
  },
  {
    "date": "Apr 2021",
    "title": "Made My First API",
    "body": "This was made with the intent to learn making REST APIs. I also wrote integration tests for every endpoint. Learned using a separate test database, mocking data and monkeypatching functions.",
    "linkText": "View Blog API",
    "linkUrl": "https://api.psts.xyz/"
  },
  {
    "date": "May 2021",
    "title": "Front End and Connecting to API",
    "body": "This was a front end made to be used with the Blog API. Learned my API endpoints could be improved. Had endpoints for individual posts or replies only, made endpoints that provided posts complete with nested replies. Also learned how to manage multiple domains and sub-domains when I deployed this on my Linode VPS.",
    "linkText": "View Blog Front End",
    "linkUrl": "https://fastapi.psts.xyz/"
  },
  {
    "date": "June 2021",
    "title": "Started Learning Javascript",
    "body": "Started following the the foundations track at The Odin Project. Learned the fundamentals of Javascript. At this point I switched to Ubuntu as my OS while working, started using VSCode and did majority of Git through the command line.",
    "linkText": "View Calculator",
    "linkUrl": "https://zakmcrae.github.io/calc/"
  },
  {
    "date": "July-August 2021",
    "title": "Continued Learning Javascript",
    "body": "Loosely followed along with The Odin Project as some subjects I'd covered already in Python. Lots of projects made during this time such as rock paper scissors, drawing-pad, a calculator. Got practice with Webpack, Babel, Dom Manipulation and ES6+ features.",
    "linkText": "View Tic-Tac-Toe",
    "linkUrl": "https://zakmcrae.github.io/tic-tac-toe/"
  },
  {
    "date": "August 2021",
    "title": "Started Learning React",
    "body": "Did many projects from The Odin Project to learn React such as a resume builder, a memory game and a shopping cart. Got practice with class based and functional components, state, props, lifecycle methods and hooks.",
    "linkText": "View Breaking Bad Memory Game",
    "linkUrl": "https://zakmcrae.github.io/breaking-bad-memory-game/"
  },
  {
    "date": "September 2021",
    "title": "Started Learning Nodejs and Express",
    "body": "Did many projects from The Odin Project to learn Nodejs/Express such as an inventory application, mini message board and an app to practice various user permission levels. Got practice with MongoDB, writing and using middleware, and testing.",
    "linkText": "View Whisky Warehouse",
    "linkUrl": "https://young-eyrie-64675.herokuapp.com/"
  },
  {
    "date": "October 2021",
    "title": "Further Projects and Job Search",
    "body": "As I am nearing my time running out on learning full time, I am working on another large project. This project is a calorie counting app with a Nodejs/Express back end and a React front end. I also completed this personal portfolio website before I begin looking for a job. Thanks for reading this far!",
    "linkText": "View ScaleDown API Repo",
    "linkUrl": "https://github.com/ZakMcRae/scale-down-api"
  },
  {
    "date": "November 2021",
    "title": "Job Search, Assessments and Interviews",
    "body": "I applied to positions in the front end, full stack and back end areas of web development. I was selected by a few companies to do development assessments which led to some interviews. I have started working with a freelancer in a full stack javascript position helping with his extra work.",
    "linkText": "View Developer Assessment",
    "linkUrl": "https://github.com/ZakMcRae/poster-counts"
  },
  {
    "date": "December 2021",
    "title": "First Paid Work and Published Content",
    "body": "I have completed a few projects/tasks in my new position. I created a landing page from a design mockup and updated/modified some pug html templates and routes in an express app. I have started working on a prototype react native app for a local restaurant delivery service.",
    "linkText": "View IndiEats Landing Page",
    "linkUrl": "https://indieats.ca/"
  }
]
